app/controllers/school_classes_controller.rb

INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "The woobles"], ["room_number", 808], ["created_at", "2016-10-24 13:57:39.130113"], ["updated_at", "2016-10-24 13:57:39.130113"]]
---
  def create
    @schoolclass = SchoolClass.create(post_params(:title, :room_number))

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT 1  [["id", 4]]
UPDATE "school_classes" SET "title" = ?, "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "Risk Analysis"], ["room_number", 10], ["updated_at", "2016-10-24 14:02:55.800941"], ["id", 1]]
---
  def update
    @schoolclass = SchoolClass.find(params[:id])
    @schoolclass.update(post_params(:title, :room_number))