app/controllers/students_controller.rb

  def create
    @student = Student.create(post_params(:first_name, :last_name))
---
INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "NEWESTSTUDENT"], ["last_name", "BESTSTUDENT"], ["created_at", "2016-10-24 13:37:30.687072"], ["updated_at", "2016-10-24 13:37:30.687072"]]